#include "afpclient.h"
#include "test.h"

#include <pwd.h>
#include <stdint.h>


/* -------------------------------------------*/
static char *dsi_command2str[] = {
    "???",
    "DSIFUNC_CLOSE",   // 1       /* DSICloseSession */
    "DSIFUNC_CMD",     // 2       /* DSICommand */
    "DSIFUNC_STAT",    // 3       /* DSIGetStatus */
    "DSIFUNC_OPEN",    // 4       /* DSIOpenSession */
    "DSIFUNC_TICKLE",  // 5       /* DSITickle */
    "DSIFUNC_WRITE",   // 6       /* DSIWrite */
    "DSI???",		   // 7
    "DSIFUNC_ATTN",    // 8       /* DSIAttention */
};

char *afp_error(int error) {
    char *s;

    switch (ntohl(error)) {
    case AFPERR_ACCESS  :
        s = "AFPERR_ACCESS  ";
        break; /* -5000   permission denied */

    case AFPERR_AUTHCONT:
        s = "AFPERR_AUTHCONT";
        break; /* -5001   logincont */

    case AFPERR_BADUAM  :
        s = "AFPERR_BADUAM  ";
        break; /* -5002   uam doesn't exist */

    case AFPERR_BADVERS :
        s = "AFPERR_BADVERS ";
        break; /* -5003   bad afp version number */

    case AFPERR_BITMAP  :
        s = "AFPERR_BITMAP  ";
        break; /* -5004   invalid bitmap */

    case AFPERR_CANTMOVE:
        s = "AFPERR_CANTMOVE";
        break; /* -5005   can't move file */

    case AFPERR_DENYCONF:
        s = "AFPERR_DENYCONF";
        break; /* -5006   file synchronization locks conflict */

    case AFPERR_DIRNEMPT:
        s = "AFPERR_DIRNEMPT";
        break; /* -5007   directory not empty */


    case AFPERR_ITYPE   :
        s = "AFPERR_ITYPE   ";
        break; /* -5030   wrong icon type */

    case AFPERR_VLOCK   :
        s = "AFPERR_VLOCK   ";
        break; /* -5031   volume locked */

    case AFPERR_OLOCK   :
        s = "AFPERR_OLOCK   ";
        break; /* -5032   object locked */

    case AFPERR_CTNSHRD :
        s = "AFPERR_CTNSHRD ";
        break; /* -5033   share point contains a share point */

    case AFPERR_NOID    :
        s = "AFPERR_NOID    ";
        break; /* -5034   file thread not found */

    case AFPERR_EXISTID :
        s = "AFPERR_EXISTID ";
        break; /* -5035   file already has an id */

    case AFPERR_DIFFVOL :
        s = "AFPERR_DIFFVOL ";
        break; /* -5036   different volume */

    case AFPERR_CATCHNG :
        s = "AFPERR_CATCHNG ";
        break; /* -5037   catalog has changed */

    case AFPERR_SAMEOBJ :
        s = "AFPERR_SAMEOBJ ";
        break; /* -5038   source file == destination file */

    case AFPERR_BADID   :
        s = "AFPERR_BADID   ";
        break; /* -5039   non-existent file id */

    case AFPERR_PWDSAME :
        s = "AFPERR_PWDSAME ";
        break; /* -5040   same password/can't change password */

    case AFPERR_PWDSHORT:
        s = "AFPERR_PWDSHORT";
        break; /* -5041   password too short */

    case AFPERR_PWDEXPR :
        s = "AFPERR_PWDEXPR ";
        break; /* -5042   password expired */

    case AFPERR_INSHRD  :
        s = "AFPERR_INSHRD  ";
        break; /* -5043   folder being shared is inside a */

    case AFPERR_INTRASH :
        s = "AFPERR_INTRASH ";
        break; /* -5044   shared folder in trash. */

    case AFPERR_PWDCHNG :
        s = "AFPERR_PWDCHNG ";
        break; /* -5045   password needs to be changed */

    case AFPERR_PWDPOLCY:
        s = "AFPERR_PWDPOLCY";
        break; /* -5046   password fails policy check */

    case AFPERR_USRLOGIN:
        s = "AFPERR_USRLOGIN";
        break; /* -5047   user already logged on */

    case 0				:
        s = "";
        break;

    case -1             :
        s = "EOF";
        break;

    default				:
        s = "unknow";
        break;
    }

    return s;
}

/* --------------------------------------------------- */
const char *AfpNum2name(int num) {
    switch (num) {
    case AFP_BYTELOCK      :
        return "AFP_BYTELOCK      ";   /*   1 */

    case AFP_CLOSEVOL      :
        return "AFP_CLOSEVOL      ";  	/*   2 */

    case AFP_CLOSEDIR      :
        return "AFP_CLOSEDIR      ";  	/*   3 */

    case AFP_CLOSEFORK     :
        return "AFP_CLOSEFORK     ";  	/*   4 */

    case AFP_COPYFILE      :
        return "AFP_COPYFILE      ";  	/*   5 */

    case AFP_CREATEDIR     :
        return "AFP_CREATEDIR     ";  	/*   6 */

    case AFP_CREATEFILE    :
        return "AFP_CREATEFILE    ";  	/*   7 */

    case AFP_DELETE        :
        return "AFP_DELETE        "; 	/*   8 */

    case AFP_ENUMERATE     :
        return "AFP_ENUMERATE     "; 	/*   9 */

    case AFP_FLUSH         :
        return "AFP_FLUSH         ";	/*	10 */

    case AFP_FLUSHFORK     :
        return "AFP_FLUSHFORK     ";	/*	11 */

    case AFP_GETFORKPARAM  :
        return "AFP_GETFORKPARAM  ";   /*	14 */

    case AFP_GETSRVINFO    :
        return "AFP_GETSRVINFO    "; 	/* 	15 */

    case AFP_GETSRVPARAM   :
        return "AFP_GETSRVPARAM   ";   /*	16 */

    case AFP_GETVOLPARAM   :
        return "AFP_GETVOLPARAM   ";   /*	17 */

    case AFP_LOGIN         :
        return "AFP_LOGIN         ";  	/*  18 */

    case AFP_LOGOUT        :
        return "AFP_LOGOUT        ";  	/*  20 */

    case AFP_MAPID         :
        return "AFP_MAPID         ";   /*  21 */

    case AFP_MAPNAME       :
        return "AFP_MAPNAME       ";   /*  22 */

    case AFP_MOVE          :
        return "AFP_MOVE          ";   /*  23 */

    case AFP_OPENVOL       :
        return "AFP_OPENVOL       ";  	/*  24 */

    case AFP_OPENDIR       :
        return "AFP_OPENDIR       ";  	/*  25 */

    case AFP_OPENFORK      :
        return "AFP_OPENFORK      ";  	/*  26 */

    case AFP_READ		   :
        return "AFP_READ          ";	/*  27 */

    case AFP_RENAME        :
        return "AFP_RENAME        ";   /*  28 */

    case AFP_SETDIRPARAM   :
        return "AFP_SETDIRPARAM   ";   /*  29 */

    case AFP_SETFILEPARAM  :
        return "AFP_SETFILEPARAM  ";   /*  30 */

    case AFP_SETFORKPARAM  :
        return "AFP_SETFORKPARAM  ";   /*  31 */

    case AFP_SETVOLPARAM   :
        return "AFP_SETVOLPARAM   ";   /*  32 */

    case AFP_WRITE 		   :
        return "AFP_WRITE         ";	/*  33 */

    case AFP_GETFLDRPARAM  :
        return "AFP_GETFLDRPARAM  ";	/*  34 */

    case AFP_SETFLDRPARAM  :
        return "AFP_SETFLDRPARAM  ";	/*  35 */

    case AFP_CHANGEPW      :
        return "AFP_CHANGEPW      ";	/*  36 */

    case AFP_GETSRVRMSG    :
        return "AFP_GETSRVRMSG    ";   /*  38 */

    case AFP_CREATEID      :
        return "AFP_CREATEID      ";   /*  39 */

    case AFP_DELETEID      :
        return "AFP_DELETEID      ";   /*  40 */

    case AFP_RESOLVEID     :
        return "AFP_RESOLVEID     ";   /*  41 */

    case AFP_EXCHANGEFILE  :
        return "AFP_EXCHANGEFILE  ";   /*  42 */

    case AFP_CATSEARCH     :
        return "AFP_CATSEARCH     ";   /*  43 */

    case AFP_OPENDT        :
        return "AFP_OPENDT        ";	/*  48 */

    case AFP_CLOSEDT       :
        return "AFP_CLOSEDT       ";	/*	49 */

    case AFP_GETICON       :
        return "AFP_GETICON       ";	/*	51 */

    case AFP_GTICNINFO     :
        return "AFP_GTICNINFO     ";	/*	52 */

    case AFP_ADDAPPL       :
        return "AFP_ADDAPPL       ";  	/*	53 */

    case AFP_RMVAPPL       :
        return "AFP_RMVAPPL       ";  	/*	54 */

    case AFP_GETAPPL       :
        return "AFP_GETAPPL       ";   /*	55 */

    case AFP_ADDCMT        :
        return "AFP_ADDCMT        ";   /*	56 */

    case AFP_RMVCMT        :
        return "AFP_RMVCMT        ";   /*	57 */

    case AFP_GETCMT        :
        return "AFP_GETCMT        ";   /*	58 */

    /* version 3.0 */
    case AFP_BYTELOCK_EXT  :
        return "AFP_BYTELOCK_EXT  ";   /*  59 */

    case AFP_READ_EXT      :
        return "AFP_READ_EXT      ";   /*  60 */

    case AFP_WRITE_EXT     :
        return "AFP_WRITE_EXT     ";   /*  61 */

    case AFP_GETSESSTOKEN  :
        return "AFP_GETSESSTOKEN  ";   /*  64 */

    case AFP_LOGIN_EXT     :
        return "AFP_LOGIN_EXT     ";   /*  63 */

    case AFP_DISCTOLDSESS  :
        return "AFP_DISCTOLDSESS  ";   /*  65 */

    case AFP_ENUMERATE_EXT :
        return "AFP_ENUMERATE_EXT ";   /*  66 */

    case AFP_CATSEARCH_EXT :
        return "AFP_CATSEARCH_EXT ";   /*  67 */

    /* version 3.1 */
    case AFP_ENUMERATE_EXT2:
        return "AFP_ENUMERATE_EXT2";   /*  68 */

    case AFP_ZZZ           :
        return "AFP_ZZZ           ";	/* 122 */

    /* version 3.2 */
    case AFP_GETACL        :
        return "AFP_GETACL        ";   /* 73 */

    case AFP_GETEXTATTR    :
        return "AFP_GETEXTATTR    ";   /* 69 */

    case AFP_SETEXTATTR    :
        return "AFP_SETEXTATTR    ";   /* 69 */

    case AFP_REMOVEATTR :
        return "AFP_REMOVEATTR ";   /* 70 */

    case AFP_LISTEXTATTR  :
        return "AFP_LISTEXTATTRA  ";   /* 72 */

    case AFP_ADDICON       :
        return "AFP_ADDICON";       	/* 192 */
    }

    return "not yet defined";
}

/* --------------------------------------------------- */
void dump_header(DSI *dsi) {
    char *s;

    if (Quiet) {
        return;
    }

    if (Verbose) {
        fprintf(stdout, "clientID              %d\n", dsi->clientID);
        fprintf(stdout, "cmdlen                %lu\n\n", dsi->cmdlen);
        fprintf(stdout, "header.dsi_flags      %d %s\n", dsi->header.dsi_flags,
                dsi->header.dsi_flags ? "REPLY" : "REQUEST");
        fprintf(stdout, "header.dsi_command    %d %s\n", dsi->header.dsi_command,
                dsi_command2str[dsi->header.dsi_command]);
        fprintf(stdout, "header.dsi_requestID  %d\n", ntohs(dsi->header.dsi_requestID));
    }

    if (0 != dsi->header.dsi_code || Verbose) {
        fprintf(stdout, "header.dsi_code       %d", ntohl(dsi->header.dsi_code));

        if (dsi->header.dsi_flags) {
            s = afp_error(dsi->header.dsi_code);
